# Pandas 마무리하기

In [38]:
import pandas as pd
import numpy as np

## Data Frame에 난수 저장하기

* Numpy 패키지의 rand( ) 함수 이용.   
* rand( ) 함수는 난수를 생성해 배열에 저장하고, 이 배열을 리턴.   
* rand( ) 함수의 파라미터로는 생성할 배열의 Shape을 전달.

In [39]:
np.random.rand(5,6)

array([[0.23615584, 0.40294258, 0.73851164, 0.79757474, 0.33968454,
        0.11840341],
       [0.45465739, 0.71890682, 0.66418072, 0.66700017, 0.66756504,
        0.98857548],
       [0.04802751, 0.63216933, 0.06594584, 0.16928214, 0.51912736,
        0.53051936],
       [0.39086908, 0.72453374, 0.76865589, 0.16202678, 0.29591148,
        0.02210657],
       [0.71029321, 0.12571914, 0.24430741, 0.01320252, 0.50342019,
        0.58011766]])

### rand( ) 함수로 생성한 배열로 Data Frame 만들기

In [40]:
df = pd.DataFrame(np.random.rand(4, 3), columns = ['A', 'B', 'C'])

In [41]:
df

          A         B         C
0  0.421583  0.562567  0.389965
1  0.486216  0.812375  0.871488
2  0.235802  0.809718  0.646676
3  0.786898  0.346411  0.753452

In [42]:
df2 = pd.DataFrame(np.random.rand(4, 3), columns = ['A', 'B', 'C'])

In [43]:
df2

          A         B         C
0  0.649618  0.815695  0.101276
1  0.651604  0.134890  0.497212
2  0.342610  0.395388  0.687699
3  0.686817  0.853378  0.417779

## Data Frame의 통계적 분포 확인

In [44]:
df.describe()

              A         B         C
count  4.000000  4.000000  4.000000
mean   0.482625  0.632768  0.665395
std    0.228942  0.223978  0.205297
min    0.235802  0.346411  0.389965
25%    0.375138  0.508528  0.582499
50%    0.453899  0.686143  0.700064
75%    0.561386  0.810382  0.782961
max    0.786898  0.812375  0.871488

## Data Frame 연산하기

* Numpy 배열의 연산과 원리 같음
* 한 Data Frame에 속한 컬럼끼리 연산할 수 있음
* 인덱스끼리는 연산 불가
* Data Frame에 문자열이 포함되면 연산 불가

### 하나의 Data Frame의 컬럼끼리 연산하기

In [45]:
df.A + df.C

0    0.811548
1    1.357704
2    0.882478
3    1.540350
dtype: float64

### 두 Data Frame 연산하기

In [46]:
df.A + df2.A

0    1.071201
1    1.137820
2    0.578412
3    1.473716
Name: A, dtype: float64

In [47]:
df + df2

          A         B         C
0  1.071201  1.378262  0.491242
1  1.137820  0.947265  1.368701
2  0.578412  1.205106  1.334375
3  1.473716  1.199789  1.171231

## Data Frame 합치기

In [48]:
df3 = pd.DataFrame([1, 2, 3], columns = ['A'])

In [49]:
df4 = pd.DataFrame([4, 5, 6], columns = ['B'])

In [50]:
df5 = pd.DataFrame([4, 5], columns = ['B'])

In [51]:
df3.join(df4, how = 'outer')

   A  B
0  1  4
1  2  5
2  3  6

In [52]:
df3.join(df5, how = 'outer')

   A    B
0  1  4.0
1  2  5.0
2  3  NaN

행 수가 다른 두 Data Frame도 합칠 수 있음. 짧은 쪽에 NaN이 들어감.

## 데이터 그룹핑

In [66]:
df6 = pd.DataFrame(
    [
        ['Mike', 30, 1, 'M'],
        ['Sarah', 22, 0, 'F'],
        ['David', 31, 4, 'M'],
        ['Daniel', 25, 1, 'M'],
        ['Lucy', 33, 3, 'F']
    ],
    columns = ['Name', 'Age', 'Children', 'Gender']
)

In [67]:
df6

     Name  Age  Children Gender
0    Mike   30         1      M
1   Sarah   22         0      F
2   David   31         4      M
3  Daniel   25         1      M
4    Lucy   33         3      F

In [68]:
df7 = df6.groupby('Gender').mean()

In [69]:
df7

              Age  Children
Gender
F       27.500000       1.5
M       28.666667       2.0

* mean( ) 함수의 리턴값도 Data Frame
* Name 컬럼의 자료형은 문자열이므로, 평균 연산을 하지 않음

In [63]:
df6.groupby('Gender').std()

             Age  Children
Gender
F       7.778175  2.121320
M       3.214550  1.732051

In [65]:
df6.groupby('Name').mean()

         Age  Children
Name
Daniel  25.0       1.0
David   31.0       4.0
Lucy    33.0       3.0
Mike    30.0       1.0
Sarah   22.0       0.0